1yib.rust-bundle
adpyke.vscode-sql-formatter
anthropic.claude-code
anysphere.cursorpyright
charliermarsh.ruff
chukong technologies.cocos-creator
chukong technology.cocos-debug
csharpier.csharpier-vscode
dbaeumer.vscode-eslint
devsense.composer-php-vscode
devsense.intelli-php-vscode
devsense.phptools-vscode
devsense.profiler-php-vscode
dustypomerleau.rust-syntax
esbenp.prettier-vscode
gitlab.gitlab-workflow
golang.go
graphql.vscode-graphql
graphql.vscode-graphql-syntax
juanblanco.solidity
kevinrose.vsc-python-indent
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.js-debug-nightly
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.vscode-typescript-next
naco-siren.gradle-language
openai.chatgpt
redhat.fabric8-analytics
redhat.java
redhat.vscode-yaml
rust-lang.rust-analyzer
serayuzgur.crates
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
vue.volar
yoavbls.pretty-ts-errors
